# Aufgabe 6

Alle Aufgaben

In [35]:
import pandas as pd
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

In [36]:
t = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')#,dtype_backend='numpy_nullable')

In [37]:
t.shape

(891, 12)

In [38]:
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 6.1 Einfache Gruppierung

a)Wie viele Passagiere haben keine Information zu ihrer Kabine?

In [39]:
missing_cabine_count = t["Cabin"].isna().sum()
missing_cabine_count

687

-- SELECT COUNT(*) AS missing_cabin_count
-- FROM your_table_name
-- WHERE Cabin IS NULL;

b) Haben nur Passagiere der dritten Klasse keine Kabine oder haben wir eher ein
Datenqualitätsproblem?

In [40]:
class_3 = t.loc[t["Pclass"]==3, "Cabin"]
class_3.shape

(491,)

-- SELECT COUNT(*) AS count_class_3
-- FROM your_table_name
-- WHERE Pclass = 3;

In [41]:
clas_3_nan = t.loc[t["Pclass"]==3, "Cabin"].isna()
clas_3_nan.sum()

479

-- SELECT COUNT(*) AS missing_cabin_count
-- FROM your_table_name
-- WHERE Pclass = 3 AND Cabin IS NULL;

c) Welche unterschiedlichen Kabinen gab es? Erstellen Sie eine sortierte Liste.

In [42]:
sorted_unique_cabins = t.groupby("Cabin").first().index.sort_values().tolist() # Anstelle von first soll ,am size nehmen
sorted_unique_cabins

['A10',
 'A14',
 'A16',
 'A19',
 'A20',
 'A23',
 'A24',
 'A26',
 'A31',
 'A32',
 'A34',
 'A36',
 'A5',
 'A6',
 'A7',
 'B101',
 'B102',
 'B18',
 'B19',
 'B20',
 'B22',
 'B28',
 'B3',
 'B30',
 'B35',
 'B37',
 'B38',
 'B39',
 'B4',
 'B41',
 'B42',
 'B49',
 'B5',
 'B50',
 'B51 B53 B55',
 'B57 B59 B63 B66',
 'B58 B60',
 'B69',
 'B71',
 'B73',
 'B77',
 'B78',
 'B79',
 'B80',
 'B82 B84',
 'B86',
 'B94',
 'B96 B98',
 'C101',
 'C103',
 'C104',
 'C106',
 'C110',
 'C111',
 'C118',
 'C123',
 'C124',
 'C125',
 'C126',
 'C128',
 'C148',
 'C2',
 'C22 C26',
 'C23 C25 C27',
 'C30',
 'C32',
 'C45',
 'C46',
 'C47',
 'C49',
 'C50',
 'C52',
 'C54',
 'C62 C64',
 'C65',
 'C68',
 'C7',
 'C70',
 'C78',
 'C82',
 'C83',
 'C85',
 'C86',
 'C87',
 'C90',
 'C91',
 'C92',
 'C93',
 'C95',
 'C99',
 'D',
 'D10 D12',
 'D11',
 'D15',
 'D17',
 'D19',
 'D20',
 'D21',
 'D26',
 'D28',
 'D30',
 'D33',
 'D35',
 'D36',
 'D37',
 'D45',
 'D46',
 'D47',
 'D48',
 'D49',
 'D50',
 'D56',
 'D6',
 'D7',
 'D9',
 'E10',
 'E101',
 'E12',
 'E121',
 'E17',
 'E24',
 'E25',
 'E31',
 'E33',
 'E34',
 'E36',
 'E38',
 'E40',
 'E44',
 'E46',
 'E49',
 'E50',
 'E58',
 'E63',
 'E67',
 'E68',
 'E77',
 'E8',
 'F E69',
 'F G63',
 'F G73',
 'F2',
 'F33',
 'F38',
 'F4',
 'G6',
 'T']

-- SELECT DISTINCT Cabin
-- FROM your_table_name
-- WHERE Cabin IS NOT NULL
-- ORDER BY Cabin;

d) Wie viele unterschiedliche Kabinen gab es?

In [43]:
len(sorted_unique_cabins)

147

In [44]:
t.groupby(by="Cabin").size().count()

147

-- SELECT COUNT(DISTINCT Cabin) AS unique_cabin_count
-- FROM your_table_name
-- WHERE Cabin IS NOT NULL;

e) Gibt es einen Zusammenhang zwischen der Klasse und der Kabinennummer?
<br> <br>
Keinen erkenntlichen Zusammenhang

In [45]:
class1_unique_cabins = t.loc[t["Pclass"]==1, "Cabin"].unique
print(class1_unique_cabins)

<bound method Series.unique of 1              C85
3             C123
6              E46
11            C103
23              A6
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 216, dtype: object>

-- SELECT DISTINCT Cabin
-- FROM your_table_name
-- WHERE Pclass = 1 AND Cabin IS NOT NULL;

In [46]:
class2_unique_cabins = t.loc[(t["Pclass"]==2)&(t["Cabin"].notna()), "Cabin"].unique
print(class2_unique_cabins)

<bound method Series.unique of 21      D56
66      F33
123    E101
148      F2
183      F4
193      F2
292       D
303    E101
327       D
340      F2
345     F33
473       D
516     F33
618      F4
717    E101
772     E77
Name: Cabin, dtype: object>

-- SELECT DISTINCT Cabin
-- FROM your_table_name
-- WHERE Pclass = 2 AND Cabin IS NOT NULL;

In [47]:
class3_unique_cabins = t.loc[(t["Pclass"]==3)&(t["Cabin"].notna()), "Cabin"].unique
print(class3_unique_cabins)

<bound method Series.unique of 10        G6
75     F G73
128    F E69
205       G6
251       G6
394       G6
429      E10
699    F G63
715    F G73
751     E121
776      F38
823     E121
Name: Cabin, dtype: object>

-- SELECT DISTINCT Cabin
-- FROM your_table_name
-- WHERE Pclass = 3 AND Cabin IS NOT NULL;

Alternativ

In [48]:
t.groupby(by="Pclass")["Cabin"].unique()

Pclass
1    [C85, C123, E46, C103, A6, C23 C25 C27, nan, B...
2                [nan, D56, F33, E101, F2, F4, D, E77]
3       [nan, G6, F G73, F E69, E10, F G63, E121, F38]
Name: Cabin, dtype: object

f) Wie viele Passagiere waren im Schnitt und wie viele maximal in einer Kabine?

Gruppieren nach Klasse und Kabine

In [49]:
grouped_cabine_class = t.groupby(["Pclass","Cabin"])

-- SELECT Pclass, Cabin, COUNT(*)
-- FROM your_table_name
-- GROUP BY Pclass, Cabin;

Durchschnitt von ANzahl passagiere in Kabine

In [50]:
grouped_cabine_passenger = grouped_cabine_class["PassengerId"].count()
grouped_cabine_passenger.mean()

1.3877551020408163

-- SELECT Pclass, Cabin, COUNT(PassengerId) AS PassengerCount
-- FROM your_table_name
-- GROUP BY Pclass, Cabin;

-- WITH PassengerCounts AS (
--     SELECT Pclass, Cabin, COUNT(PassengerId) AS PassengerCount
--     FROM your_table_name
--     GROUP BY Pclass, Cabin
-- )
-- SELECT AVG(PassengerCount) AS AveragePassengerCount
-- FROM PassengerCounts;

Max Anzahl Passagiere in Kabine

In [51]:
grouped_cabine_passenger.max()

4

Alternativ

In [52]:
pers_per_cabine = t.groupby(by="Cabin").size()
print(f'Durchschnitt {pers_per_cabine.mean()}  Maximale Anzahl: {pers_per_cabine.max()}')

Durchschnitt 1.3877551020408163  Maximale Anzahl: 4

-- SELECT MAX(PassengerCount) AS MaxPassengerCount
-- FROM PassengerCounts;

g) In wie viele Kabinen waren Minderjährige gebucht?

In [53]:
# Filtern des DataFrames, um nur Minderjährige zu erhalten
minors_df = t.loc[t['Age'] < 18]

# Zählen der einzigartigen Kabinen, in denen Minderjährige gebucht waren
unique_cabins_with_minors = minors_df['Cabin'].count()
unique_cabins_with_minors

19

-- SELECT COUNT(DISTINCT Cabin) AS unique_cabins_with_minors
-- FROM your_table_name
-- WHERE Age < 18 AND Cabin IS NOT NULL;

Mit lambda

In [54]:
grouped_cabin = t.groupby("Cabin")

In [55]:
minderjährige_in_kabine = grouped_cabin["Age"].apply(lambda x: (x < 18).any())
minderjährige_in_kabine.sum()

14

Alternativ

## 6.2. Minimum

a) Finden Sie den kleinsten und größten Fahrpreis je Klasse.

In [56]:
grouped_classes = t.groupby("Pclass")

In [57]:
grouped_classes.agg({"Fare":("min","max")})

       Fare
        min       max
Pclass
1       0.0  512.3292
2       0.0   73.5000
3       0.0   69.5500

Alternativ

def einzig(s):
    return s.unique()

t.groupby(by="Pclass")["Fare"].agg(
    klein="min",
    groß="max",
    einzig=einzig
)

b) Oft ist man nicht nur am Wert, sondern auch an den zugehörigen Daten interessiert, die
zu diesem Wert gehören. Finden Sie mit idxmin() die Namen der Passagiere mit den
extremen Fahrpreisen aus a) heraus.

In [58]:
grouped_classes = t.groupby('Pclass')

min_names = []
max_names = []

for group, group_df in grouped_classes:
    min_idx = group_df['Fare'].idxmin()
    max_idx = group_df['Fare'].idxmax()
    
    min_names.append(t.loc[min_idx, 'Name'])
    max_names.append(t.loc[max_idx, 'Name'])

result = grouped_classes['Fare'].agg(['min', 'max'])
result['min_name'] = min_names
result['max_name'] = max_names

print(result)

        min       max                     min_name                    max_name
Pclass
1       0.0  512.3292        Harrison, Mr. William            Ward, Miss. Anna
2       0.0   73.5000  Parkes, Mr. Francis "Frank"        Hood, Mr. Ambrose Jr
3       0.0   69.5500          Leonard, Mr. Lionel  Sage, Master. Thomas Henry

c) Falls das Minimum / Maximum nicht eindeutig ist, welchen Wert liefert dann
idxmin()?

Die Methoden idxmin() und idxmax() in Pandas geben den Index des ersten Minimums bzw. Maximums zurück, wenn es mehrere Einträge mit dem gleichen minimalen oder maximalen Wert gibt.

Wenn es also in einer Serie oder einem DataFrame mehrere Zeilen mit dem gleichen minimalen (oder maximalen) Wert gibt, wird idxmin() (oder idxmax()) den Index der ersten dieser Zeilen zurückgeben.

d) Wir würden gerne alle Passagiere mit extremen Fahrpreisen gemäß a) kennen.

In [59]:
# Rangieren der Fahrpreise in aufsteigender und absteigender Reihenfolge innerhalb jeder Klasse
t['min_rank'] = t.groupby('Pclass')['Fare'].rank(method='min')
t['max_rank'] = t.groupby('Pclass')['Fare'].rank(method='min', ascending=False)

# Filtern des DataFrames, um den ersten Eintrag für das Minimum und Maximum jeder Klasse zu behalten
min_fares = t[t['min_rank'] == 1].groupby('Pclass').first().reset_index()[['Pclass', 'Name', 'Fare']]
max_fares = t[t['max_rank'] == 1].groupby('Pclass').first().reset_index()[['Pclass', 'Name', 'Fare']]

# Kombinieren der beiden DataFrames
extreme_fares = pd.concat([min_fares, max_fares], axis=0).sort_values(by='Pclass').reset_index(drop=True)

print(extreme_fares)

   Pclass                         Name      Fare
0       1        Harrison, Mr. William    0.0000
1       1             Ward, Miss. Anna  512.3292
2       2  Parkes, Mr. Francis "Frank"    0.0000
3       2         Hood, Mr. Ambrose Jr   73.5000
4       3          Leonard, Mr. Lionel    0.0000
5       3   Sage, Master. Thomas Henry   69.5500

Alternativ

In [60]:
idx = t.groupby(by="Pclass")["Fare"].nlargest(1, keep='all')
print(idx)
idx.index.get_level_values

Pclass
1       258    512.3292
        679    512.3292
        737    512.3292
2       72      73.5000
        120     73.5000
        385     73.5000
        655     73.5000
        665     73.5000
3       159     69.5500
        180     69.5500
        201     69.5500
        324     69.5500
        792     69.5500
        846     69.5500
        863     69.5500
Name: Fare, dtype: float64

<bound method MultiIndex.get_level_values of MultiIndex([(1, 258),
            (1, 679),
            (1, 737),
            (2,  72),
            (2, 120),
            (2, 385),
            (2, 655),
            (2, 665),
            (3, 159),
            (3, 180),
            (3, 201),
            (3, 324),
            (3, 792),
            (3, 846),
            (3, 863)],
           names=['Pclass', None])>

## 6.3. Quantile

Berücksichtigt quantile() Null-Werte? Testen Sie.

Die quantile() Methode gibt den Wert des angegebenen Quantils für eine gegebene Datenmenge zurück.

Die Methode quantile() in Pandas berücksichtigt keine NaN (Null)-Werte bei der Berechnung. Das bedeutet, dass NaN-Werte standardmäßig ausgeschlossen werden.

In [61]:
import pandas as pd

# Erstellen eines Beispieldatenframes mit einigen Null-Werten
data = {'values': [10, 20, 30, 40, 50, None, pd.NA]}
df = pd.DataFrame(data)

# Berechnen des Quantils ohne die Behandlung von Null-Werten
quantile_without_handling_na = df['values'].quantile(0.5)

# Berechnen des Quantils mit explizitem Ausschluxss von Null-Werten
quantile_with_dropna = df['values'].dropna().quantile(0.5)

quantile_without_handling_na, quantile_with_dropna

(30.0, 30.0)

Test: <br>
- Das Medianquantil (0,5) des Beispieldatenframes ohne explizites Handling von Null-Werten ergab 30.0.
- Das Medianquantil (0,5) des Beispieldatenframes, bei dem NaN-Werte explizit mit dropna() ausgeschlossen wurden, ergab ebenfalls 30.0.

Aggregation und Sortierung
Für welche der vorgestellten Aggregations-Funktionen beeinflusst die Sortierung der
Daten im DataFrame das Ergebnis?

Soweit ich weiß keine von
- sum(): Summe der Werte
- mean(): Mittelwert der Werte
- median(): Median der Werte
- min(): Minimum der Werte
- max(): Maximum der Werte
- std(): Standardabweichung
- var(): Varianz
- count(): Anzahl der nicht-NA-Zellen
- nunique(): Anzahl der einzigartigen Werte
- quantile(): Wert am gegebenen Quantil

Wichtig für:
- indexmax
- first(), last(), nte()
- cumSumme

## 6.5. Duplikate

a) Mit dem Attribut .is_unique kann man herausfinden, ob eine Series nur eindeutige
Werte enthält.
Überprüfen Sie, ob („Name“) ein Schlüssel ist.

In [62]:
t_names = t["Name"]
t_names.is_unique

True

b) Definieren Sie „Name“ als Index und stellen Sie per assert sicher, dass er eindeutig ist.

In [63]:
# Setzen des Index
t_index_name = t.set_index('Name', inplace=True)

# Hinweis wenn der Index nicht einzigartig ist 
assert t.index.is_unique, "Der Index 'Name' ist nicht eindeutig!"

c) Überprüfen Sie, ob („Ticket“, „Cabin“) ein Schlüssel ist.

In [64]:
# Überprüfen, ob "Ticket" eindeutig ist
is_ticket_unique = t['Ticket'].is_unique

# Überprüfen, ob "Cabin" eindeutig ist
is_cabin_unique = t['Cabin'].is_unique

# Überprüfen, ob die Kombination aus "Ticket" und "Cabin" eindeutig ist
t['Ticket_Cabin'] = t['Ticket'].astype(str) + '_' + t['Cabin'].astype(str)
is_ticket_cabin_unique = t['Ticket_Cabin'].is_unique

# Löschen der zusammengesetzten Spalte
del t['Ticket_Cabin']

is_ticket_unique, is_cabin_unique, is_ticket_cabin_unique
# True, wenn "Ticket" eindeutig ist, sonst False.
# True, wenn "Cabin" eindeutig ist, sonst False.
# True, wenn die Kombination aus "Ticket" und "Cabin" eindeutig ist, sonst False.

(False, False, False)

d) Ermitteln Sie die Passagiere, für die es mindestens 4 (damit das Ergebnis kleiner wird)
Duplikate für („Ticket“, „Cabin“) erzeugen.

In [65]:

# Gruppieren nach "Ticket" und "Cabin" und zählen der Passagiere in jeder Gruppe
grouped_counts = t.groupby(['Ticket', 'Cabin']).size()

# Filtern der Gruppen, die mindestens 4 Duplikate haben
tickets_cabins_with_duplicates = grouped_counts.loc[grouped_counts >= 4].index.tolist()

# Filtern des DataFrames, um Passagiere mit den identifizierten "Ticket" und "Cabin"-Kombinationen zu erhalten
passengers_with_duplicates = t[t.set_index(['Ticket', 'Cabin']).index.isin(tickets_cabins_with_duplicates)]

passengers_with_duplicates[['Ticket', 'Cabin']]

                                           Ticket        Cabin
Name
Fortune, Mr. Charles Alexander              19950  C23 C25 C27
Fortune, Miss. Mabel Helen                  19950  C23 C25 C27
Fortune, Miss. Alice Elizabeth              19950  C23 C25 C27
Carter, Mr. William Ernest                 113760      B96 B98
Carter, Miss. Lucile Polk                  113760      B96 B98
Fortune, Mr. Mark                           19950  C23 C25 C27
Carter, Mrs. William Ernest (Lucile Polk)  113760      B96 B98
Carter, Master. William Thornton II        113760      B96 B98

In [70]:
s_t = t.groupby(by=["Ticket","Cabin"]).size()
s_t
#s_t.loc[s_t>=4]

Ticket             Cabin
110152             B77      2
                   B79      1
110413             E67      2
                   E68      1
110465             A14      1
                           ..
SC/AH Basle 541    D        1
SC/Paris 2163      D        1
SOTON/O.Q. 392078  E10      1
W.E.P. 5734        E31      1
WE/P 5735          B22      2
Length: 161, dtype: int64

In [67]:
# Oder
dup =(
    t.groupby(by=["Ticket", "Cabin"]).size()
    .loc[lambda s: s>=4]
    .reset_index()
    .rename(columns={0: "Count"})
)
dup

   Ticket        Cabin  Count
0  113760      B96 B98      4
1   19950  C23 C25 C27      4

In [68]:
##Nach Passagieren filter
rows = (t["Ticket"].isin(dup["Ticket"])) & (t["Cabin"].isin(dup["Cabin"]))

(
    t.set_index(["Ticket", "Cabin"])
    .loc[dup[["Ticket", "Cabin"]]]
    .sort_values(by=["Ticket", "Cabin"])
    [["Ticket", "Cabin", "Name", "PassengerId"]]  
)

ValueError: Cannot index with multidimensional key

In [ ]:
t.merge(dup)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,min_rank,max_rank,Count
0,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S,210.0,4.0,4
1,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S,210.0,4.0,4
2,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0,C23 C25 C27,S,210.0,4.0,4
3,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0,C23 C25 C27,S,210.0,4.0,4
4,391,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0,B96 B98,S,175.0,39.0,4
5,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0,B96 B98,S,175.0,39.0,4
6,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0,B96 B98,S,175.0,39.0,4
7,803,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0,B96 B98,S,175.0,39.0,4

e) Ermitteln Sie die Duplikate von d) über value_counts().

In [ ]:
# Kombinieren von "Ticket" und "Cabin" in einer Spalte und Verwenden von value_counts() 
ticket_cabin_counts = t[['Ticket', 'Cabin']].astype(str).agg('_'.join, axis=1).value_counts()

# Filtern der Kombinationen, die mindestens 4 Duplikate haben
duplicates = ticket_cabin_counts[ticket_cabin_counts >= 4].index.tolist()

# Filtern des DataFrames, um Passagiere mit den identifizierten "Ticket" und "Cabin"-Kombinationen zu erhalten
passengers_with_duplicates_value_counts = t[t[['Ticket', 'Cabin']].astype(str).agg('_'.join, axis=1).isin(duplicates)]

passengers_with_duplicates_value_counts[['Ticket', 'Cabin']]

       Ticket Cabin
7      349909  <NA>
13     347082  <NA>
16     382652  <NA>
24     349909  <NA>
25     347077  <NA>
..        ...   ...
846  CA. 2343  <NA>
850    347082  <NA>
858      2666  <NA>
863  CA. 2343  <NA>
885    382652  <NA>

[81 rows x 2 columns]

## 6.6 Wie wird man ein SQL-HAVING in pandas abbilden?

In SQL wird das HAVING-Schlüsselwort verwendet, um Bedingungen nach einer Aggregation anzuwenden. In Pandas können Sie eine ähnliche Funktionalität erreichen, indem Sie die Methode groupby() verwenden, gefolgt von einer Aggregationsfunktion und dann die resultierenden Gruppen mit einer Bedingung filtern.

Zusammenfassend lässt sich sagen, dass Sie in Pandas das HAVING-Schlüsselwort aus SQL durch die Kombination von groupby(), agg() und Bedingungen mit loc[] abbilden können.